In [2]:
from PyPDF2 import PdfFileReader
from pathlib import Path
import re
import glob
import PyPDF2

In [2]:
pdf_path = "F:\puran\Data_science\ML_Sudhanshu_Sir\data_visualization\my"

In [60]:
for file in glob.glob(pdf_path + "/*.pdf"):
    print(file)
    if file.endswith('.pdf'):
        fileReader = PyPDF2.PdfFileReader(open(file, "rb"))
        count = 0
        count = fileReader.numPages
        while count>=0:
            count-=1
            pageObj = fileReader.getPage(count)
            text = pageObj.extractText()
            print(text)
        num = re.findall(r'[0-9]+', text)
        print(num)
    else:
        print('file not in format')

In [4]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 
'londON_StockhOlm',
 
 
'Budapest_PaRis', 'Brussels_londOn'],
 
 
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
 
 
'RecentDelays': [[
23, 47], [], [24, 43, 87], [13], [67, 32]],
 
 
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
 
 
'12. Air France', '"Swiss Air"']})

In [5]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [4]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [6]:
a = df['FlightNumber']
for i in range(len(df['FlightNumber'])):
    a[i+1]=df['FlightNumber'][i] + 10

a

<ipython-input-6-785e2075adeb>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a[i+1]=df['FlightNumber'][i] + 10

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
5    10095.0
Name: FlightNumber, dtype: float64

In [68]:
for i in range(len(df['FlightNumber'])):
    df['FlightNumber'][i+1] = df['FlightNumber'][i] + 10
    
df['FlightNumber']

<ipython-input-68-ad2d4078b2bc>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['FlightNumber'][i+1] = df['FlightNumber'][i] + 10

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [7]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [8]:
df['FlightNumber'] = df['FlightNumber'].astype('int32')

In [13]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [9]:
new = df['From_To'].str.split("_", n = 1,expand = True)

In [10]:
df['From'] = new[0]
df['To'] = new[1]

df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085,"[67, 32]","""Swiss Air""",Brussels,londOn

In [14]:
df.drop(columns = ['From_To'],inplace = True)
df

In [15]:
a11 = []
for i in range(len(df['From'])):
    a11.append(df['From'][i].capitalize())

df['From'] = a11
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      paris
1         10055            []    <Air France> (12)    Madrid      miLAN
2         10065  [24, 43, 87]  (British Airways. )    London  StockhOlm
3         10075          [13]       12. Air France  Budapest      PaRis
4         10085      [67, 32]          "Swiss Air"  Brussels     londOn

In [16]:
a12 = []
for i in range(len(df['To'])):
    a12.append(df['To'][i].capitalize())

df['To'] = a12
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [17]:
ab = []
for i in df['RecentDelays']:
    ab.append(len(i))

max(ab)

3

In [18]:
for i in df['RecentDelays']:
    print(i)

[23, 47]
[]
[24, 43, 87]
[13]
[67, 32]

In [74]:
list(range(max(ab)))

[0, 1, 2]

In [82]:
a11 = []
a12 = ['Nan',23,343]
a11.append(a12)
a11

[['Nan', 23, 343]]

In [19]:
l=[]
for j in range(max(ab)):
    l11 = []
    for i in df['RecentDelays']:
        if len(i)!=0 and j<len(i):
            l11.append(i[j])
        else:
            l11.append('Nan')
    l.append(l11)

l

[[23, 'Nan', 24, 13, 67],
 [47, 'Nan', 43, 'Nan', 32],
 ['Nan', 'Nan', 87, 'Nan', 'Nan']]

In [20]:
for i in range(1,len(l)+1):
    df['RecentDelays'+str(i)] = l[i-1]

df

,FlightNumber,RecentDelays,Airline,From,To,RecentDelays1,RecentDelays2,RecentDelays3
0,10045,"[23, 47]",KLM(!),London,Paris,23,47,Nan
1,10055,[],<Air France> (12),Madrid,Milan,Nan,Nan,Nan
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,10075,[13],12. Air France,Budapest,Paris,13,Nan,Nan
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67,32,Nan

In [21]:
df

,FlightNumber,RecentDelays,Airline,From,To,RecentDelays1,RecentDelays2,RecentDelays3
0,10045,"[23, 47]",KLM(!),London,Paris,23,47,Nan
1,10055,[],<Air France> (12),Madrid,Milan,Nan,Nan,Nan
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,24,43,87
3,10075,[13],12. Air France,Budapest,Paris,13,Nan,Nan
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,67,32,Nan